Repository: nibou230/ojs
Catalog: plugins/generic/fileFormatFilter/locale/*/locale.po
Languages: fr_ca

# plugins.generic.fileFormatFilter.name
source: File Format Filter Plugin
fr_ca: Plugiciel pour les filtres des formats de fichier

# plugins.generic.fileFormatFilter.description
source: This plugin allows, for each genre, the creation of a list of accepted or refused file formats.
fr_ca: Ce plugiciel permet, pour chaque élément, la création d'une liste des formats de fichier acceptés ou refusés.

# plugins.generic.fileFormatFilter.settings.title
source: List of all file formats to include or exclude.
fr_ca: Liste de tous les formats de fichier à inclure ou à exclure.

# plugins.generic.fileFormatFilter.settings.include
source: Include
fr_ca: Inclure

# plugins.generic.fileFormatFilter.settings.exclude
source: Exclude
fr_ca: Exclure

# plugins.generic.fileFormatFilter.settings.hint
source: The formats must be separated by the character ",".
fr_ca: Les formats doivent être séparés par le caractère « , ».

# plugins.generic.fileFormatFilter.settings.placeholder
source: Example: pdf, doc, docx
fr_ca: Exemple : pdf, doc, docx

# plugins.generic.fileFormatFilter.uploadFailed.format.exclusion
source: The file could not be uploaded because the format is not supported for this document type. Here is the list of prohibited formats: {$formats}.
fr_ca: Le fichier n'a pu être transmis car le format n'est pas supporté pour ce type de document. Voici la liste des formats proscrits : {$formats}.

# plugins.generic.fileFormatFilter.uploadFailed.format.inclusion
source: The file could not be uploaded because the format is not supported for this document type. Here is the list of authorized formats: {$formats}.
fr_ca: Le fichier n'a pu être transmis car le format n'est pas supporté pour ce type de document. Voici la liste des formats autorisés : {$formats}.

# plugins.generic.fileFormatFilter.uploadFailed.format.empty
source: The file could not be uploaded because it does not have any format.
fr_ca: Le fichier n'a pu être transmis car il ne possède aucun format.
